interface IRequirements {
	title: string
	description: string
}

export const what: string =
	'Хотите испытать незабываемые моменты командной игры? Тогда присоединяйтесь к паку Mo в игре Squad! Пак Mo является частью клана RSGS, объединяя игроков, которые стремятся к победе и готовы делиться своим опытом. Вместе мы разрабатываем эффективные стратегии, координируем действия и добиваемся успехов на виртуальных полях сражений. Становясь членом нашей команды, вы окажетесь среди единомышленников, готовых поддерживать друг друга в любых ситуациях. С нами вы сможете значительно повысить свои игровые навыки, освоить новые тактические приёмы и погрузиться в атмосферу настоящего боевого братства. Присоединяйтесь сейчас и ощутите всю мощь настоящей команды!'

export const application: string =
	'Перед подачей заявки на вступление в наш пак Mo, пожалуйста, следуйте данной инструкции: перейдите на сервер RSGS по зелёной кнопке, подайте заявку на вступление в клан HYDRA, после того как вы стали членом клана, нажмите на кнопку «Зарегистрироваться», и после успешной регистрации вам станет доступна подача заявки на вступление в наш пак. Следуя этим шагам, вы сможете успешно подать заявку и начать свой путь в нашем сообществе.'

export const requirements: IRequirements[] = [
	{
		title: 'Участник клана RSGS:',
		description:
			'Прежде чем подать заявку в наш пак, вы должны быть членом клана RSGS. Это обязательное условие, так как мы являемся подкланом этого сообщества.',
	},
	{
		title: 'Минимальный возраст:',
		description:
			'Вам должно быть не менее 18 лет. Мы ценим зрелость и ответственность наших участников.',
	},
	{
		title: 'Опыт игры:',
		description:
			'Желательно иметь хотя бы средний уровень опыта в игре Squad. Это поможет вам быстро освоиться в нашей тактике и стратегии.',
	},
	{
		title: 'Коммуникабельность:',
		description:
			'Умение эффективно общаться и работать в команде — одно из ключевых качеств. Мы активно используем голосовой чат для координации действий.',
	},
	{
		title: 'Регулярная активность:',
		description:
			'Мы ожидаем, что участники будут регулярно участвовать в играх и тренировках. Постоянство — залог успеха.',
	},
	{
		title: 'Готовность учиться:',
		description:
			'Даже опытные игроки должны быть открытыми к новым знаниям и совершенствовать свои навыки.',
	},
	{
		title: 'Положительное отношение:',
		description:
			'Дружелюбие и уважение к другим участникам команды — важные качества. Негативные эмоции и токсичное поведение не допустимы.',
	},
	{
		title: 'Наличие микрофона:',
		description:
			'Голосовое общение критически важно для эффективной координации на поле боя.',
	},
]
